* Расчёты для четвертой главы курсового

** 4.1
*** Суммарная площадь занимаемая всеми ИЭТ
**** Площадь круглых ИЭТ
В третьем столбце диаметр компонента, в четвертом площадь, в втором
количество.
#+constants: pi=3.1415926
| R1...R4  | 4 | 2.5 |    19.635 |        мм |
| R9...R10 | 2 | 2.5 |    9.8175 |           |
| R11, R12 | 2 | 1.6 |  4.021248 |           |
| R13      | 1 | 1.6 |  2.010624 |           |
| R14      | 1 | 1.6 |  2.010624 |           |
| R15      | 1 | 2.5 |   4.90875 |           |
| C1       | 1 |  13 |  132.7326 |           |
| C2       | 1 |  13 |  132.7326 |           |
| C3       | 1 |  10 |     78.54 |           |
| C4, C5   | 2 | 6.3 | 62.345052 |           |
| HA1      | 1 |  12 |  113.0976 |           |
| HL1      | 1 |   3 |    7.0686 |           |
| Sum      |   |     |           | 568.92020 |
#+TBLFM: $4=(($3/2)^2)* 3.1416 * $2::@13$5=vsum(@1$4..@-1$4)
**** Площадь прямоугольных ИЭТ
| Десигнатор   | Количество | Длина | Ширина |   #ERROR | Суммарная |
| R5...R8      |          4 |   9.5 |   7.45 |    283.1 |           |
| DA1  (TO220) |          1 | 10.16 |   4.45 |   45.212 |           |
| DD1 (ATmega) |          1 | 39.75 |  14.73 | 585.5175 |           |
| SA1, SA2     |          2 |  16.3 |   14.9 |   485.74 |           |
| VD1 (DO-41)  |          1 | 54.86 |   2.72 | 149.2192 |           |
| VD2 (DO-35)  |          1 | 54.40 |      2 |    108.8 |           |
| VD3 (TO-92)  |          1 |  3.70 |   4.70 |    17.39  |           |
| X1, X5       |          2 |  16.3 |   14.9 |   485.74 |           |
| X3           |          1 |   6.6 |    4.6 |    30.36 |           |
| X4           |          1 |   6.1 |   4.05 |   24.705 |           |
| ZQ1          |          1 |  11.9 |    5.6 |    66.64 |           |
| Sum          |            |       |        |          | 2282.4237 |

#+TBLFM: $5=($3 * $4) * $2::$6=vsum(@2$5..@-1$5)::@15$5=vsum(@2$$5..@-1$5)
**** Сумма площадей ИЭТ
#+begin_src elisp
	 (+  568.9  2282.4)
#+end_src

#+RESULTS:
: 2851.3
*** Приблизительная площадь печатной платы с учетом монтажа
#+begin_src elisp
 (let ((m 1) (kz 0.8))
    (/ 2851 (* m kz)))
  
#+end_src

#+RESULTS:
: 3563.75
**** Реальная площадь между тем
Площадь:	6767,9500 mm²
*** Cуммарный объём ИЭТ
**** Объём круглых ИЭТ
В предпоследнем столбце высота, в последнем площадь
| R1...R4  | DIN0207                     | 4 | 2.5 | 5.8 |     58. |
| R9...R10 | DIN0207                     | 2 | 2.5 | 5.8 |     29. |
| R11, R12 | DIN0204                     | 2 | 1.6 | 3.6 |   11.52 |
| R13      | DIN0204                     | 1 | 1.6 | 3.6 |    5.76 |
| R14      | DIN0204                     | 1 | 1.6 | 3.6 |    5.76 |
| R15      | DIN0207                     | 1 | 2.5 | 5.8 |    14.5 |
| C1       | в перечне ссылка на даташит | 1 |  13 |  25 |     325 |
| C2       |                             | 1 |  13 |  20 |     260 |
| C3       |                             | 1 |  10 |  20 |     200 |
| C4, C5   |                             | 2 | 6.3 |  19 |   239.4 |
| HA1      |                             | 1 |  12 |   9 |     108 |
| HL1      |                             | 1 |   3 |   9 |      27 |
| Sum      |                             |   |     |     | 1283.94 |
#+TBLFM: $6=$3 * $4 * $5::@13$6=vsum(@1$6..@-1$6)

https://kicad.github.io/footprints/Capacitor_THT

https://doc.platan.ru/pdf/00554.pdf

https://eu.mouser.com/c/electromechanical
**** Объём прямоугольных ИЭТ
| R5...R8      | 4 |   9.5 |  7.45 | 11.35 |     431.3 |
| DA1  (TO220) | 1 | 10.16 |  4.45 | 15.25 |    154.94 |
| DD1 (ATmega) | 1 | 39.75 | 14.73 |  4.75 |  188.8125 |
| SA1, SA2     | 2 |  16.3 |  14.9 |     4 |     130.4 |
| VD1 (DO-41)  | 1 | 54.86 |  2.72 |  2.72 |  149.2192 |
| VD2 (DO-35)  | 1 | 54.40 |     2 |     2 |     108.8 |
| VD3 (TO-92)  | 1 |  3.70 |  4.70 |  4.70 |     17.39 |
| X1, X5       | 2 |  16.3 |  14.9 |     4 |     130.4 |
| X3           | 1 |   6.6 |   4.6 |     4 |      26.4 |
| X4           | 1 |   6.1 |  4.05 |     4 |      24.4 |
| ZQ1          | 1 |  11.9 |   5.6 |     4 |      47.6 |
| Sum          |   |       |       |       | 1409.6617 |
#+TBLFM: $6=$2 *$3 * $5::@12$6=vsum(@1$6..@-1$6)

#+begin_src elisp
  (+ 1410 1284)
#+end_src

#+RESULTS:
: 2694
**** Объём всего устройства
Коэффициент заполнения 0.8
#+begin_src elisp
(/  (+ 1410 1284) 0.8)
#+end_src

#+RESULTS:
: 3367.5
** 4.2
*** Поверхность корпуса блока и нагртой зоны
|   l1 | l2 | l3 (высота) |     Sk |  Kz |   |
| 84.5 | 85 |          32 | 19789. | 0.8 |   |
#+TBLFM: @2$4=$1 * $2 * 2 + $3*($1+$2)
*** Условная поверхность нагретой зоны
|   l1 | l2 | l3 (высота) |      Sz |  Kz |   |
| 84.5 | 85 |          32 | 18704.2 | 0.8 |   |
#+TBLFM: @2$4=$1 * $2 * 2 + $3*($1+$2) * 0.8
*** Удельная мощность корпуса по блоку
q_k
#+begin_src elisp
  (/ 12 0.019790) ;;м2
#+end_src

#+RESULTS:
: 606.366851945427

**** Транзистор, мощность
#+begin_src elisp
  (* 60 0.2)
#+end_src

#+RESULTS:
: 12.0

*** Удельная мощность нагретой зоны
#+begin_src elisp
  (/ 12 0.018704) ;;м2
#+end_src

#+RESULTS:
: 641.5739948674081

*** vartheta1

#+begin_src python
  q_k = 606
  vartheta_1 = 0.1472 * q_k  - 0.2962 * 10 ** -3 * q_k ** 2 + 0.3127 * 10 ** -6 * q_k ** 2
  return vartheta_1
#+end_src

#+RESULTS:
: -19.457268502800016

*** vartheta2

#+begin_src python
  q_k = 606
  vartheta_2 =  0.1390 * q_k - 0.1223 * 10 ** -3 * q_k ** 2 + 0.0698 * 10 ** -6 * q_k ** 3
  return vartheta_2
#+end_src

#+RESULTS:
: 54.8546793168

*** vartheta_k
#+begin_src python
  vartheta_k = -19.46 * 0.999
  return vartheta_k
#+end_src

#+RESULTS:
: -19.440540000000002

*** vartheta_z
#+begin_src python :session t
  vartheta_k = 0
  vartheta_2 = 54.85
  vartheta_1 = -19.6
  vartheta_z = vartheta_k + (vartheta_2 - vartheta_1 ) * 0.996
  return vartheta_z
#+end_src

#+RESULTS:

*** vartheta_v
#+begin_src python
  theta_k = 0
  theta_2 = 54.85
  theta_1 = -19.6
  theta_z = theta_k + (theta_2 - theta_1 ) * 0.996
  theta_v = 0.5 * (theta_k + theta_z)

#+end_src

*** q_el
#+begin_src python
  s = 1.7 * 10 ** -5
  P = 12
  return P / s
#+end_src

#+RESULTS:
: 705882.3529411765

*** theta_el
#+begin_src python :session t :results output
  theta_z = theta_k + (theta_2 - theta_1 ) * 0.996
  return theta_z
  print(theta_z)
#+end_src

#+RESULTS:

** 4.4 РИТС

*** Максимальная длина высота и площадь ПУ

#+begin_src python :results output
  import math
  l = 0.25 #meter
  a_g = math.radians(90)
  a_v = math.radians(75)
  L = 2 * l * math.tan(a_g/2)
  H = 2 * l * math.tan(a_v/2)
  print(L, H, L*H)
#+end_src

#+RESULTS:
: 0.49999999999999994 0.3836634939894802 0.19183174699474007

*** Минимально допустимые размеры ПУ
#+begin_src python
  return 0.25 * 0.25
#+end_src

#+RESULTS:
: 0.0625
#+begin_src python
  return 0.25 ** 2 * 5 / 8 
#+end_src

#+RESULTS:
: 0.0390625

** Расчёт надёжности

*** К_н
Принял за 0.8

*** Этап 2

*** Этап 3.
| Designator | lambda_b |
| R1...R4    |    0.044 |
| R5...R8    |    0.183 |
| R9...R10   |    0.044 |
| R13        |    0.044 |
| R14        |    0.044 |
| R15        |    0.044 |
| C1         |    0.173 |
| C2         |    0.173 |
| C4, C5     |    0.022 |
| DA1        |    0.023 |
| DD1        |    0.023 |
| HA1        |    0.034 |
| HL1        |    0.034 |
| SA1,SA2    |   0.0104 |
| VD1...VD3  |    0.091 |
| VT1        |    0.044 |
| X1...X5    |   0.0041 |
|            |          |
